In [174]:
import pandas as pd

In [191]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

In [192]:
df = pd.DataFrame(data)

In [193]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

melt() — Wide to Long
    The melt() method in Pandas is used to unpivot a DataFrame from wide format to long format. In other words, it takes columns       that represent different variables and combines them into key-value pairs (i.e., long-form data).

When to Use melt():
When you have a DataFrame where each row is an observation, and each column represents a different variable or measurement, and you want to reshape the data into a longer format for easier analysis or visualization.

Syntax:
df.melt(id_vars=None, value_vars=None, var_name=None, value_name="value", col_level=None)

Parameters:

    id_vars: The columns that you want to keep fixed (these columns will remain as identifiers).

    value_vars: The columns you want to unpivot (the ones you want to "melt" into a single column).

    var_name: The name to use for the new column that will contain the names of the melted columns (default is 'variable').

    value_name: The name to use for the new column that will contain the values from the melted columns (default is 'value').

    col_level: Used for multi-level column DataFrames.

In [194]:
df2 = df.melt( id_vars = ["Name"], value_vars = [ "Math", "Science", "English"], var_name = "Subject", value_name = "Score")

pivot() — Long to Wide
The pivot() function in Pandas is used to reshape data, specifically to turn long-format data into wide-format data. This is the reverse operation of melt().

How it works:
pivot() takes a long-format DataFrame and turns it into a wide-format DataFrame by specifying which columns will become the new columns, the rows, and the values.

Syntax:
df.pivot(index=None, columns=None, values=None)

Parameters:
index: The column whose unique values will become the rows of the new DataFrame.
columns: The column whose unique values will become the columns of the new DataFrame.
values: The column whose values will fill the new DataFrame. These will become the actual data (values in the table).

In [195]:
df2

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [196]:
df_copy = df2.copy()

In [197]:
df2 = df2.pivot(index="Name", columns="Subject", values="Score")

In [198]:
df2.columns.name = None

In [199]:
df2

         English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [200]:
df2 = df2.reset_index()

In [201]:
df2

      Name  English  Math  Science
0    Alice       88    85       90
1      Bob       85    78       82
2  Charlie       94    92       89

Here this is the one line code:


pivot_df = (
    df2.pivot(index="Name", columns="Subject", values="Score")
       .rename_axis(None, axis=1)
       .reset_index()
)

Why use pivot()?

    1. Better data structure: It makes data easier to analyze when you have categories that you want to split into multiple columns.
    2. Easier visualization: Often, you want to represent data in a format where categories are split across columns (for example, when creating pivot tables for reporting).
    3. Aggregating data: You can perform aggregations (like sum, mean, etc.) to group values before pivoting

Important Notes:
    1. Duplicate Entries: If you have multiple rows with the same combination of index and columns, pivot() will raise an error. 
         In such cases, you should use pivot_table() (which can handle duplicate entries by aggregating them).

We can use pivot_table() to aggregate values (e.g., taking the mean for duplicate entries):
             df.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")

In [203]:
df_copy

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [204]:
new_rows = [
    {"Name" : "Alice", "Subject" : "Math", "Score" : 90},
    {"Name" : "Bob", "Subject" : "English", "Score" : 90}
]
df_copy = pd.concat([df_copy, pd.DataFrame(new_rows)], ignore_index=True)

In [206]:
df_copy

       Name  Subject  Score
0     Alice     Math     85
1       Bob     Math     78
2   Charlie     Math     92
3     Alice  Science     90
4       Bob  Science     82
5   Charlie  Science     89
6     Alice  English     88
7       Bob  English     85
8   Charlie  English     94
9     Alice     Math     90
10      Bob  English     90

In [207]:
#here Alice has two scores in Maths, and Bob has two scores in English.
#if you directly pivot it, it'll give error 
#so you should add "aggfunc" with any other value for those scores, like in my case I have done mean.

df_copy.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")

Subject  English  Math  Science
Name
Alice       88.0  87.5     90.0
Bob         87.5  78.0     82.0
Charlie     94.0  92.0     89.0

Summary:
    1. Use melt() to go long, pivot() to go wide
    2. pivot() is used to turn long-format data into wide-format by spreading unique column values into separate columns.
    3. If there are duplicate values for a given combination of index and columns, you should use pivot_table() with an        aggregation function to handle the duplicates.